app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-08-21 00:57:09.582564"], ["updated_at", "2018-08-21 00:57:09.582564"]]
---
  def create
    # could also write Post.create(params[:post])
    Post.create(title: params[:post][:title], description: params[:post][:description])